var child1=[{"name": "案件基本表(包括老案件)", "size": 96},
      {"name": "案件基本表(包括老案件和未结案)", "size": 96},
      {"name": "案件线索表(包括老案件)", "size": 41},
      {"name": "罚没物品表(包括老案件)", "size": 17},
      {"name": "复议案件表(包括老案件)", "size": 72},
      {"name": "复议案件表(包括老案件和未结案)", "size": 64},
      {"name": "案件核审表(包括老案件)", "size": 15},
      {"name": "案件线索表", "size": 36},
      {"name": "复议案件表", "size": 60},
      {"name": "案件基本表", "size": 93},
      {"name": "罚没物品表", "size": 12}
];
var child2=[
      {"name": "登记单基本信息", "size": 63},
      {"name": "申诉信息", "size": 35},
      {"name": "申诉处理单", "size": 80},
      {"name": "申诉转案件线索处理单", "size": 77},
      {"name": "举报信息", "size": 30},
      {"name": "举报处理单", "size": 77},
      {"name": "举报处理罚没物品信息", "size": 12},
      {"name": "咨询信息", "size": 35},
      {"name": "咨询处理单", "size": 19},
      {"name": "建议信息", "size": 22},
      {"name": "建议处理单", "size": 15},
      {"name": "典型案例代码", "size": 8},
      {"name": "典型案例信息", "size": 8},
      {"name": "进展情况记录", "size": 9},
      {"name": "问题分类", "size": 2}
];
//企业登记主题
var child3=[
      {"name": "企业(机构)", "size": 63},
      {"name": "企业(机构)附表", "size": 24},
      {"name": "主要人员", "size": 28},
      {"name": "人员职务", "size": 9},
      {"name": "外资企业(机构)附属表", "size": 40},
      {"name": "外商(机构)投资企业投资", "size": 24},
      {"name": "代表机构雇员表", "size": 14},
      {"name": "投资人", "size": 33},
      {"name": "分期缴付信息", "size": 8},
      {"name": "股权冻结信息", "size": 22},
      {"name": "股东质押信息", "size": 32},
      {"name": "企业联系人", "size": 15},
      {"name": "企业许可证信息", "size": 17},
      {"name": "清算信息", "size": 12},
      {"name": "企业类型参数表", "size": 7},
      {"name": "隶属企业机构", "size": 5},
      {"name": "委托人", "size": 8},
      {"name": "企业迁移信息", "size": 18},
      {"name": "分支机构", "size": 9},
      {"name": "企业证照", "size": 20},
      {"name": "综合分组信息", "size": 5},
      {"name": "市场主体删除表", "size": 5},
      {"name": "未知表", "size": 7},
      {"name": "党建表", "size": 21}
     ];
//名称登记主题
var child4=[
      {"name": "企业名称表", "size": 31},
      {"name": "企业信息表", "size": 20},
      {"name": "投资人及出资信息", "size": 16},
      {"name": "授权企业表", "size": 15},
      {"name": "业务受理表", "size": 17},
      {"name": "业务受理表(已确认)", "size": 17}
     ];
//企业登记历史主题
var child5=[
      {"name": "股权转让历史信息", "size": 18},
      {"name": "企业机构历史", "size": 54},
      {"name": "企业机构补充历史", "size": 23},
      {"name": "主要人员历史", "size": 29},
      {"name": "人员职务历史", "size": 8},
      {"name": "外资企业机构历史", "size": 39},
      {"name": "外商(机构)投资企业投资历史", "size": 23},
      {"name": "投资人历史", "size": 35},
      {"name": "分期缴付历史", "size": 7},
      {"name": "股权冻结历史", "size": 20},
      {"name": "股东质押信息历史", "size": 33},
      {"name": "企业联系人历史", "size": 15},
      {"name": "企业许可证历史", "size": 11},
      {"name": "清算历史", "size": 11},
      {"name": "隶属企业机构历史", "size": 5},
      {"name": "委托人历史", "size": 8},
      {"name": "分支机构历史", "size": 9},
      {"name": "企业证照历史", "size": 18},
      {"name": "综合分组历史", "size": 5}
     ];
//个体登记主题
var child6=[
      {"name": "个体工商户基本表", "size": 44},
      {"name": "个体工商户基本信息附表", "size": 26},
      {"name": "个体经营者基本信息表", "size": 29},
      {"name": "个体迁移信息", "size": 15},
      {"name": "个体证照", "size": 17},
      {"name": "个体许可证信息", "size": 12}
     ];
//个体登记历史主题
var child7=[
      {"name": "个体工商户基本信息历史", "size": 11},
      {"name": "个体工商户基本信息附表历史", "size": 25},
      {"name": "个体经营者基本历史", "size": 29},
      {"name": "个体证照历史", "size": 17},
      {"name": "个体许可证历史", "size": 11}
     ];
//集团登记主题
var child8=[
      {"name": "集团", "size": 28},
      {"name": "集团成员", "size": 11},
      {"name": "集团证照", "size": 9}
     ];
//集团登记历史主题
var child9=[
      {"name": "集团历史", "size": 22},
      {"name": "集团成员历史", "size": 11},
      {"name": "集团证照历史", "size": 11}
     ];
//登记业务办理主题
var child10=[
      {"name": "业务申请历史", "size": 31},
      {"name": "注销登记历史", "size": 18},
      {"name": "变更项目历史", "size": 5},
      {"name": "内资企业新旧注册号对照表", "size": 10},
      {"name": "私营企业新旧注册号对照表", "size": 10},
      {"name": "个体工商户新旧注册号对照表", "size": 10},
      {"name": "外资企业新旧注册号对照表", "size": 10}
     ];
//企业限制锁定(警示)主题
var child11=[
      {"name": "警示企业信息表", "size": 20},
      {"name": "警示企业限制表", "size": 13}
     ];
//年检验照主题
var child12=[
      {"name": "年检验照状态表", "size": 40},
      {"name": "年检报告书基本信息", "size": 27},
      {"name": "内资法人党建", "size": 36},
      {"name": "内资法人对外投资情况表", "size": 11},
      {"name": "内资法人经营情况表", "size": 42},
      {"name": "内资法人外埠出资情况", "size": 13},
      {"name": "内资分支党建", "size": 36},
      {"name": "内资分支年检报告书", "size": 26},
      {"name": "外资法人党建", "size": 31},
      {"name": "外资法人对外投资情况", "size": 12},
      {"name": "外资法人分期出资情况", "size": 13},
      {"name": "外资法人年检报告书", "size": 64},
      {"name": "外资法人企业出资情况", "size": 27},
      {"name": "外资法人企业分支机构情况", "size": 11},
      {"name": "外资法人企业进出口情况", "size": 10},
      {"name": "外资法人企业经营情况", "size": 22},
      {"name": "外资法人外方投资者情况", "size": 10},
      {"name": "外资法人中方投资者情况", "size": 9},
      {"name": "外资分支党建", "size": 31},
      {"name": "外资分支企业年检报告书", "size": 38},
      {"name": "外资境内文件送达人", "size": 14},
      {"name": "外资联络员信息", "size": 14},
      {"name": "个体工商户年检报告书", "size": 75},
      {"name": "个体工商户审批许可", "size": 13},
      {"name": "代表机构报告书备案信息", "size": 10},
      {"name": "代表机构业务联络情况", "size": 10},
      {"name": "代表机构代表及工作人员情况", "size": 16},
      {"name": "代表机构其他情况", "size": 19},
      {"name": "代表机构联络员信息", "size": 14},
      {"name": "代表机构报告书基本信息", "size": 22},
      {"name": "代表机构活动开展情况", "size": 14},
      {"name": "代表机构代表信息", "size": 7},
      {"name": "外资银行附加信息", "size": 25},
      {"name": "参检企业表", "size": 8},
      {"name": "从事新兴战略产业类别", "size": 5},
      {"name": "科技企业、新兴战略产业、物流", "size": 7},
      {"name": "科技企业留学归国人员信息", "size": 8},
      {"name": "外资合伙事务执行人情况", "size": 9},
      {"name": "外资合伙人情况", "size": 14}
     ];
//网格管理(合同)主题
var child13=[
      {"name": "合同不良信息", "size": 8},
      {"name": "调解信息", "size": 24},
      {"name": "合同争议简易调解信息", "size": 20},
      {"name": "守重企业", "size": 17},
      {"name": "抵押登记注销信息", "size": 5},
      {"name": "抵押物", "size": 13},
      {"name": "抵押信息变更", "size": 5},
      {"name": "抵押登记信息", "size": 30}
     ];
//网格管理(经纪人)主题",
var child14=[
      {"name": "经纪人机构人员信息表", "size": 19},
      {"name": "延期换证表", "size": 8},
      {"name": "经纪人投诉举报记录表", "size": 13},
      {"name": "处罚记录表", "size": 13},
      {"name": "良好记录", "size": 12},
      {"name": "年审记录", "size": 8},
      {"name": "经纪人员投诉记录", "size": 13},
      {"name": "持证人员资格证件表", "size": 22},
      {"name": "持证人员登记信息", "size": 21},
      {"name": "持证人员从业历史", "size": 7}
     ];
//网格管理(商标)主题",
var child15=[
      {"name": "商标基本信息", "size": 28},
      {"name": "商标企业关联维护表", "size": 18}
     ];
//网格管理(检查)主题",
var child16=[
      {"name": "户口_主体基本信息表", "size": 68},
      {"name": "户口_网格信息表", "size": 12},
      {"name": "检查无照经营", "size": 38},
      {"name": "检查问题处理表", "size": 15},
      {"name": "检查_主体巡查周期", "size": 5},
      {"name": "检查_主体检查任务表", "size": 13},
      {"name": "检查擅迁住所", "size": 29},
      {"name": "检查无照经营处理", "size": 7},
      {"name": "检查问题处理方式", "size": 4},
      {"name": "检查任务问题关联", "size": 4},
      {"name": "写字楼物业对应关系表", "size": 3},
      {"name": "户口_物业表", "size": 11},
      {"name": "用户人员", "size": 16},
      {"name": "写字楼基本信息表", "size": 14},
      {"name": "写字楼内主体信息表", "size": 20},
      {"name": "奥运涉奥主体表", "size": 7},
      {"name": "奥运涉奥场所表", "size": 16},
      {"name": "户口_主体基本信息表_注销", "size": 63}
     ];
//网格管理(拍卖会)主题",
var child17=[
      {"name": "拍卖登记企业信息", "size": 9},
      {"name": "现场兼拍", "size": 17},
      {"name": "赴外拍卖信息", "size": 9},
      {"name": "会前", "size": 34},
      {"name": "会后", "size": 18}
     ];
//广告监管主题",
var child18=[
      {"name": "广告案件基本表", "size": 34},
      {"name": "广告案件对应表", "size": 5},
      {"name": "广告案件处罚表", "size": 17},
      {"name": "提示信息表", "size": 15},
      {"name": "事业提示信息表", "size": 15},
      {"name": "社团提示信息表", "size": 15},
      {"name": "信用评价表", "size": 9},
      {"name": "良好信息", "size": 17},
      {"name": "警示信息表", "size": 15},
      {"name": "事业警示信息表", "size": 15},
      {"name": "社团警示信息表", "size": 15},
      {"name": "广告经营资格登记变更表", "size": 12},
      {"name": "广告经营资格登记审批表", "size": 51},
      {"name": "固定格式印刷品广告审批表", "size": 38},
      {"name": "烟草广告审批表", "size": 30},
      {"name": "户外广告审批表", "size": 37},
      {"name": "户外广告变更表", "size": 12},
      {"name": "投诉举报", "size": 82},
      {"name": "电台广告登记信息", "size": 43},
      {"name": "电台广播重复广告登记表", "size": 8},
      {"name": "事业法人", "size": 14},
      {"name": "社团法人", "size": 21},
      {"name": "媒体表", "size": 19},
      {"name": "网络广告登记信息", "size": 59},
      {"name": "网络重复广告登记表", "size": 10},
      {"name": "平面广告登记信息", "size": 43},
      {"name": "平面媒体重复广告登记表", "size": 10},
      {"name": "电视广告登记信息", "size": 43},
      {"name": "电视重复广告登记表", "size": 8},
      {"name": "广告审查员登记", "size": 16},
      {"name": "公益广告登记信息", "size": 32}
     ];
//地税登记信息主题
var child19=[
      {"name": "税务登记详细信息", "size": 24},
      {"name": "信用等级信息表", "size": 7},
      {"name": "欠税信息表", "size": 8},
      {"name": "加锁信息表", "size": 19},
      {"name": "解锁信息表", "size": 13},
      {"name": "提请吊销表", "size": 12}
     ];
//国家工商总局
var child20=[
      {"name": "国家局黑牌企业基本信息", "size": 35},
      {"name": "国家局黑牌企业吊销信息表", "size": 9},
      {"name": "国家局黑牌企业主要人员表", "size": 29},
      {"name": "国家局黑牌企业投资信息表", "size": 24},
      {"name": "国家局一人公司基本信息", "size": 33},
      {"name": "国家局一人公司主要人员表", "size": 29},
      {"name": "国家局一人公司投资信息表", "size": 25}
     ];
//总局登记主题",
var child21=[
      {"name": "市场主体基本信息表", "size": 32},
      {"name": "主要人员信息表", "size": 18},
      {"name": "投资信息表", "size": 25},
      {"name": "吊销信息表", "size": 11},
      {"name": "注销信息表", "size": 22},
      {"name": "年检基本信息表", "size": 11},
      {"name": "内资年检情况表", "size": 18},
      {"name": "外资联合年检出资情况表", "size": 25},
      {"name": "年检企业对外投资情况信息", "size": 14},
      {"name": "外资年检经营情况信息表", "size": 29},
      {"name": "职务信息", "size": 14}
     ];
//总局黑牌主题",
var child22=[
      {"name": "总局黑牌-吊销企业", "size": 12},
      {"name": "总局黑牌-法人股东", "size": 5},
      {"name": "总局黑牌-自然人股东", "size": 5}
     ];
	 
	 
	 
var all={'AJGL': child1,
         '12315': child2,
		 'QYDJ': child3,
         'MCDJ': child4,
		 'QYDJLS': child5,
         'GTDJ': child6,
		 'GTDJLS': child7,
         'JTDJ': child8,
		 'JTDJLS': child9,
         'ZTDJYW': child10,
		 'YZSD': child11,
         'NJYZ': child12,
		 'WGGLHT': child13,
         'WGGLJJR': child14,
		 'WGGLTM': child15,
         'WGGLJC': child16,
		 'WGGLPMH': child17,
         'GGJG': child18,
		 'DSDJ': child19,
         'GJJ': child20,
		 'ZJDJ': child21,
         'ZJHP': child22
		};
